Examinator/src/Documents/ПрохождениеПрограммыОбученияСУО/ПрохождениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеПрограммыОбученияСУО</name>
  <registerRecords>InformationRegister.ПрохожденияПрограммОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.РасписаниеПрограммОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиПрограммОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <comment>Учебная группа, в рамках которой пользователь проходит Проведение программы обучения.</comment>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/Enums/СтатусыПроведенияОбъектовСУО/СтатусыПроведенияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроведенияОбъектовСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/ПрохождениеПрограммыОбученияСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Представление(Данные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Функция Отменено(ПрохождениеПрограммыОбучения) Экспорт
	
	ДанныеОПрохождении = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеПрограммыОбучения, "ПроведениеПрограммыОбучения, Отменено");
	
	Если ДанныеОПрохождении.Отменено Тогда
		
		Возврат Истина;
		
	Иначе
		
		СтатусПроведения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОПрохождении.ПроведениеПрограммыОбучения, "Статус");
		
		Если СтатусПроведения = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СценарийОбучения(Знач ПрохождениеПрограммыОбучения) Экспорт
	
	Если ТипЗнч(ПрохождениеПрограммыОбучения) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		ПрохождениеПрограммыОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеПрограммыОбучения, "Сценарий, ПроведениеПрограммыОбучения");
	Иначе
		ПрохождениеПрограммыОбученияСвойства = ПрохождениеПрограммыОбучения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрохождениеПрограммыОбученияСвойства.Сценарий) Тогда
		Возврат ПрохождениеПрограммыОбученияСвойства.Сценарий;
	Иначе
		Возврат Документы.ПроведениеПрограммыОбученияСУО.СценарийОбучения(ПрохождениеПрограммыОбученияСвойства.ПроведениеПрограммыОбучения);
	КонецЕсли;	
	
КонецФункции

Функция Представление(Знач ПрохождениеПрограммыОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ПрохождениеПрограммыОбучения) Тогда
		Возврат "<>";
	КонецЕсли;
	
	ТребуемыеДанные = Новый Структура("Наименование, НаименованиеПользователя", "ПроведениеПрограммыОбучения.Наименование", "Пользователь.Наименование");
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеПрограммыОбучения, ТребуемыеДанные);
	
	Возврат Строка(Данные.Наименование) + " / " + Строка(Данные.НаименованиеПользователя) + " /";
			
КонецФункции

#КонецОбласти


#КонецЕсли
